export const navPrimary = [
  { title: "Главная", path: "/" },
  { title: "Услуги", path: "/services" },
  { title: "Работы", path: "/works" },
];

export const socials = [
  { title: "Behance", path: "/" },
  { title: "Awwwards", path: "/" },
  { title: "Telegram", path: "/" },
  { title: "GitHub", path: "/" },
];

export const navFooter = [
  { title: "Контакты", path: "/" },
  { title: "Сбор данных", path: "/" },
  { title: "Политика обработки данных", path: "/" },
];

export const services = [
  {
    slug: "/design",
    title: "Цифровой дизайн",
    image: "/images/services/01.webp",
    description: "Adobe Illustrator, Figma, Adobe After Effect",
    text: "Создаем SPA‑приложения с серверным рендерингом на основе React‑фреймворков Next.js, Angular и Vue.js. Интегрируем приложения в backend‑часть с помощью RESTful API. Оптимизируем Webpack c пре‑ и постпроцессингом CSS и JS. Выполняем архитектурную backend‑разработку на современных и безопасных технологиях и фреймворках. Используем собственную компонентную базу для разных отраслевых направлений — недвижимость, банки и интеграции с CRM. Используем микросервисную архитектуру для гибкого масштабирования веб‑приложений. Контролируем качество продуктов на всех стадиях разработки и внедрения. Покрываем код тестами, проводим функциональное и приемочное тестирование. Используем как мануальный, так и автоматизированный подход. Анализируем поведение highload‑сервисов выявляя проблемные места посредством нагрузочного тестирования и применения специальных сервисов.",
  },
  {
    slug: "/development",
    title: "Разработка",
    image: "/images/services/01.webp",
    description: "React JS, Next JS, Wordpress",
    text: "Создаем SPA‑приложения с серверным рендерингом на основе React‑фреймворков Next.js, Angular и Vue.js. Интегрируем приложения в backend‑часть с помощью RESTful API. Оптимизируем Webpack c пре‑ и постпроцессингом CSS и JS. Выполняем архитектурную backend‑разработку на современных и безопасных технологиях и фреймворках. Используем собственную компонентную базу для разных отраслевых направлений — недвижимость, банки и интеграции с CRM. Используем микросервисную архитектуру для гибкого масштабирования веб‑приложений. Контролируем качество продуктов на всех стадиях разработки и внедрения. Покрываем код тестами, проводим функциональное и приемочное тестирование. Используем как мануальный, так и автоматизированный подход. Анализируем поведение highload‑сервисов выявляя проблемные места посредством нагрузочного тестирования и применения специальных сервисов.",
  },
  {
    slug: "/copywriting",
    title: "Копирайтинг",
    image: "/images/services/01.webp",
    description: "Создаем высоконагруженные масштабируемые",
    text: "Создаем SPA‑приложения с серверным рендерингом на основе React‑фреймворков Next.js, Angular и Vue.js. Интегрируем приложения в backend‑часть с помощью RESTful API. Оптимизируем Webpack c пре‑ и постпроцессингом CSS и JS. Выполняем архитектурную backend‑разработку на современных и безопасных технологиях и фреймворках. Используем собственную компонентную базу для разных отраслевых направлений — недвижимость, банки и интеграции с CRM. Используем микросервисную архитектуру для гибкого масштабирования веб‑приложений. Контролируем качество продуктов на всех стадиях разработки и внедрения. Покрываем код тестами, проводим функциональное и приемочное тестирование. Используем как мануальный, так и автоматизированный подход. Анализируем поведение highload‑сервисов выявляя проблемные места посредством нагрузочного тестирования и применения специальных сервисов.",
  },
  {
    slug: "/product-managment",
    title: "Управление продуктом",
    image: "/images/services/01.webp",
    description: "Создаем высоконагруженные масштабируемые",
    text: "Создаем SPA‑приложения с серверным рендерингом на основе React‑фреймворков Next.js, Angular и Vue.js. Интегрируем приложения в backend‑часть с помощью RESTful API. Оптимизируем Webpack c пре‑ и постпроцессингом CSS и JS. Выполняем архитектурную backend‑разработку на современных и безопасных технологиях и фреймворках. Используем собственную компонентную базу для разных отраслевых направлений — недвижимость, банки и интеграции с CRM. Используем микросервисную архитектуру для гибкого масштабирования веб‑приложений. Контролируем качество продуктов на всех стадиях разработки и внедрения. Покрываем код тестами, проводим функциональное и приемочное тестирование. Используем как мануальный, так и автоматизированный подход. Анализируем поведение highload‑сервисов выявляя проблемные места посредством нагрузочного тестирования и применения специальных сервисов.",
  },
  {
    slug: "/marketing",
    title: "Маркетинг",
    image: "/images/services/01.webp",
    description: "Создаем высоконагруженные масштабируемые",
    text: "Создаем SPA‑приложения с серверным рендерингом на основе React‑фреймворков Next.js, Angular и Vue.js. Интегрируем приложения в backend‑часть с помощью RESTful API. Оптимизируем Webpack c пре‑ и постпроцессингом CSS и JS. Выполняем архитектурную backend‑разработку на современных и безопасных технологиях и фреймворках. Используем собственную компонентную базу для разных отраслевых направлений — недвижимость, банки и интеграции с CRM. Используем микросервисную архитектуру для гибкого масштабирования веб‑приложений. Контролируем качество продуктов на всех стадиях разработки и внедрения. Покрываем код тестами, проводим функциональное и приемочное тестирование. Используем как мануальный, так и автоматизированный подход. Анализируем поведение highload‑сервисов выявляя проблемные места посредством нагрузочного тестирования и применения специальных сервисов.",
  },
];

export const portfolio = [
  {
    slug: "/romanova",
    title: "Кондитерская Романовой",
    image: "/images/portfolio/02.webp",
    description: "Adobe Illustrator, Figma, Adobe After Effect",
  },
  {
    slug: "/development",
    title: "Таксопарк Стандарт",
    image: "/images/01.webp",
    description: "React JS, Next JS, Wordpress",
  },
];
